{"7k00ac":{"subreddit":"PUBG","Author":"rhd1989","Title":"Would you all be so kind and just stop posting screenshots of your win....","Content":"bullying content found, text deleted!","url":"https:\/\/www.reddit.com\/r\/PUBG\/comments\/7k00ac\/would_you_all_be_so_kind_and_just_stop_posting\/","Comments":[["Personally I think it's awesome these guys\/girls are so pumped they want to share it with the community, if you don't want to see them don't look, welcome to public forums.","strictlyfate"],["bullying content found, text deleted!","teccanina11"],["bullying content found, text deleted!","One_Erection_"],["bullying content found, text deleted!","MrOwlBeback24"],["bullying content found, text deleted!","carjiga"],["bullying content found, text deleted!","DarkestXMinds"],["bullying content found, text deleted!","diceshow7"],["I never posted my first win, as it was a bit embarassing finishing with 1 kill, but I don't see the problem with these threads. What's wrong with letting people have their moment? It's very exciting when you get your first din din as a new player, and not everyone has peeps at home to brag to or whatever.\n\nNot to mention, this is the sort of \"side chick\" PUBG subreddit where we can post things that would normally get buried or deleted in the main sub.\n\nIf you don't like it, downvote and move on.","yuffieXcore"],["bullying content found, text deleted!","Liblin"],["bullying content found, text deleted!","Randomonium5"],["[deleted]","None"],["If I would post every time I win then there wouldn't be any other posts on this subreddit","Fuwlz"]],"NumberOfComment":12,"Upvote_Count":7,"CreatedAt":1513348056000},"918w8l":{"subreddit":"PUBG","Author":"Dryja123","Title":"Just because the mods are non existent doesn't mean you should ruin the sub for those who want to share and enjoy PUBG content.","Content":"Thanks\n\nEdit: I feel I should add a little more. I really like lurking and seeing the funny pictures and awesome PUBG gaming content people share here. I don't need to pronograohic content in my feed just because people are trashing the moderators. ","url":"https:\/\/www.reddit.com\/r\/PUBG\/comments\/918w8l\/just_because_the_mods_are_non_existent_doesnt\/","Comments":[["bullying content found, text deleted!","mikamitcha"],["unsubscribed","polak2017"],["bullying content found, text deleted!","nilomaloki"],["bullying content found, text deleted!","109dreadwolf"],["bullying content found, text deleted!","cujububuru"]],"NumberOfComment":5,"Upvote_Count":8,"CreatedAt":1532369413000},"6uaq7s":{"subreddit":"PUBG","Author":"headsetdude1","Title":"How is LIRIK not cheating?","Content":"I like to give people the benefit of the doubt, but this is the most suspicious clip I have ever seen in PUBG.\n\nhttps:\/\/clips.twitch.tv\/DiligentCulturedFlamingoHeyGuys\n\nAfter the first down, he starts shooting and magically finds the 2nd guys head, but then he switches weapon and instantly find a 3rd guy with zero time inbetween....\n\nProve I'm wrong plz.","url":"https:\/\/www.reddit.com\/r\/PUBG\/comments\/6uaq7s\/how_is_lirik_not_cheating\/","Comments":[["Huh... 'Magically' finds it? He was already shooting in that direction, the 2nd guy was clearly visible once he was aiming at the first guy, and what third guy are you even talking about? Am I missing something here? He only knocks one dude according to the text on screen. So... you're wrong?\n\nThat promo for luminosity though. Pretty amusing.","rivenwyrm"],["OP's got this totally wrong. He downs the first guy behind the fence and empties his mag at the second guy WITHOUT downing him. Then he switches to his AR and MISSES the same guy with a single shot before getting downed himself. It makes sense that his second target doesn't get downed as the # alive doesn't change, and bullets that the second guy is shooting at Lirik's teammate can be seen still hitting the house.\n\nI assume the camera freaks out for an instant because he's aiming down the sights while still taking the gun off of his back.\n\nEDIT: FFS he even says right after that he only knocked out one guy, implying that the \"east guy\" is still up.","Frawstbyte724"],["What is fishy about this? He was already aiming at the guy before he switched weapons. All he did is pre shoot as soon as he repeaked. It's a pretty common practice in shoot gamers when peaking someone. You essentially prefire knowing where the enemy is so that if the enemy is still in the spot your are firing first and have a greater chance of winning gun battle. \n\nI mean all he did was strafe to the right and back left while switching weapons. His actual crosshairs never moved though so that he could immediately shoot again without having to adjust his aim. ","FizzleFox"],["\"Prove I'm wrong plz.\"\n\nThat's not how it works. If you think someone is cheating then you have to prove it.","Ruskeydoo"],["bullying content found, text deleted!","koodiboi"],["I dont see anything sketchy tbh changing weapon doesnt move your crosshair holding lmb will shoot instantly when the weapon is ready.","pizza125"],["bullying content found, text deleted!","StewPidassho"],["looks perfectly fine to me lol. the scope just looks weird the second before you scope in but he was already aiming at the guy when he switched his weapons","Unreal_Banana"],["I looked at this clip frame per frame.\n\nBetween seeing the 2nd guy's head at the fence, and adjusting his aim towards him, there's 18 frames. At 60 fps this is exactly 300 milliseconds delay. This is a very normal human reaction time.\n\nMoreover, there are no \"snapons\" to the head at all. On the fence guy he actually never gets the red dot fully on the head at all, mostly on the body\/neck\/wall. On the guy in the back he only has the red dot on the head momentarily the 2nd time he peeks him. That's when he already knew exactly where the guy was sitting.\n\nHe found people by looking around. Not much to explain here. Only newbies will push forwards without checking their flanks\/backs in a city where people can be anywhere.","gadbamer"],["The first two kills seem pretty legit, that instant headshot when he switched weapons does look a bit sketchy though. I'm not going to say he's cheating though. I once got a instant headshot kill from Georgpol city across the river with a red dot on a Kar, it was mainly luck. If stuff like this happened more often I would be suspicious, but he knew where they were going to be regardless and has hundreds of hours into the game, so it could be that he's just good at it.","ThisIsReLLiK"],["That's pretty sketchy.","None"],["I see nothing fishy here. What am I looking for? His headshots?","Ill_Have_You_Know_"],["Yeah, that last shot after the weapon switch doesn't look right at all.","Essemecks"],["it could be an animation cancel. if you want to test it, pull out the gun and see how early you can aim and fire. Is it before the animation is complete?","ShadowBanThisCucks"],["He only knocks the first one out with his UMP. The second player was clearly visible while he was aiming at the first. The shot when he pulled out his M16A4 with the 2x was close, but didn't knock out or even hit the second player. He was already facing the direction with his hipfire crosshairs.","knatehtknarf"],["He's done fishy stuff on stream before. I always convinced myself he was just good and that's why he's streaming. But maybe not everything is what it seems.","Pexd"],["bullying content found, text deleted!","Chasa619"],["The hacking aspect for me would be the weapon switch that was literally instantaneous, and then like cmon now I guess he could knock the guy out cus he know where he was but still like, cmon now","ChiefAmiesh"],["the man whose been streaming for 5-6 years would put his whole streaming career on the line to cheat in a game without a permanent ranking system and no money on the line.....","MesaTV"],["Pretty sure he uses an Xbox controller... looks different than a mouse movement, but definitely doesn't look like cheats","Oxpedia"],["When he opens up his inventory you can see XBOX buttons.  Could he be using some kinda Console aim assist while playing on PC?\n\nThough I don't find this clip too suspicious because he can only really aim at that one spot on the corner so good chance they will be there with heads up!","garougaming"],["Ya a little suspicious... but he did know the exact location of them, saw them. He has also played a lot of this game so I am sure he can hit headshot fairly constantly. Really hard to tell, if there are a few more clips like this i could be damning. ","Darthlemi"],["He's just good hehe","WarriorOfTheCentury"],["I really hope that this post doesn't get burried by people who believe that popular streamers are incapable of wrongdoing. ","None"]],"NumberOfComment":24,"Upvote_Count":0,"CreatedAt":1502987437000},"8ta5ot":{"subreddit":"PUBG","Author":"abbisam","Title":"???","Content":"","url":"https:\/\/i.redd.it\/9hmve9x1dr511.jpg","Comments":[["bullying content found, text deleted!","Empaze"],["* Bullets only travel 1 km\n\n* Just because Greene made the game doesn’t mean he’s the best at it\n\n* The AWM does have bullet drop, just like all weapons.\n\n* Even if this would have been before drag was implemented, the AWM’s muzzle velocity is 945 m\/s. It would take 7.1 seconds to get to Primorsk. Longer if bullet drag was implemented.\n\nIt’s BS.","thestickystickman"],["Maybe he was testing the aimbot which he would later sell it to the Chinese?","Drunktotal"],["bullying content found, text deleted!","enterjoekari"],["Sounds like one of those PUBG Legends.\nAlmost as unbelievable as PUBG is esports ready.","CrazyCR0"],["bullying content found, text deleted!","OverlordPhalanx"],["Not to mention player models disappear after about 1km actually to u\/wackyjacky101","beesandfishing"],["I once fired a shot from Pochinki hills and hit a guy in Pecado","ZER0319"],["Ignoring the bullet drop, there is a big hill off the main road north of Primorsk, and an even steeper one north of that road. There would be no line of sight and any bullet that could fly that way would hit either a house, tree, or the hills themselves","Prinzar"],["Wait the AWM doesn't have bullet drop?","mestisnewfound"],["bullying content found, text deleted!","KinkedNeck"],["\"Source: IGN\" bwahahahah!!!","WhatD0thLife"],["bullying content found, text deleted!","ironlabel1"],["IIRC at some point in its development PUBG didn't have the bullet travel distance limit and was only removed later for performance reasons. This would have made the game much more like Arma which did simulate the full path of a bullet.","theLundquist42"],["bullying content found, text deleted!","AtticusDrake58"],["Because of the \"lack of bullet drop\" this shot, among other reasons, is impossible to complete due to the difference in terrain height. The people who posted this are assholes","PeyOnReddit"],["Lol I’m having a hard time believing even a 15x will be able to see to the other side of the map lol thats wild","smoke_woods"]],"NumberOfComment":17,"Upvote_Count":44,"CreatedAt":1529766528000},"71z61b":{"subreddit":"PUBG","Author":"Daniel_B116","Title":"HOW TO INCREASE FPS ON PUBG BY 20 FPS!!","Content":"I've found a reasonably big fps booster, at least for myself. So I want to share it at least, even you dont have issues atm, I'd suggest at least to give a try.\nHead to C:\\Program Files (x86)\\Steam\\steamapps\\common\\PUBG\\TslGame\\Binaries\\Win64\nRight click to properties on \"TslGame\"\nNavigate to Compatibility -> check the \"override high DPI scaling behavior\" box, and hit \"OK\". (Application from drop-down menu)\nRestart your game if necassery.\nAnd now you should have greatly higher FPS, without making graphics look any worse AT ALL! - This also works with other games if you are having performance issues and know your hardware should run it better than that.\nFor me, I had 30-40 FPS at starter island before game starting, and game responsiveness was mehh, but now it is around 50-55 with vsync on, even after I upped a bit some settings! In game running perfectly with 60FPS.\nGo to my video for a more clear example https:\/\/www.youtube.com\/watch?v=0cKjWE8LgeA&t=1s\nOriginal reddit thread: https:\/\/www.reddit.com\/r\/PUBATTLEGROUNDS\/comments\/71gzpi\/greatly_improve_fps_new_method\/","url":"https:\/\/www.reddit.com\/r\/PUBG\/comments\/71z61b\/how_to_increase_fps_on_pubg_by_20_fps\/","Comments":[["By \"I've found\" you mean you saw the original thread and made another claiming it as your own... https:\/\/www.reddit.com\/r\/PUBATTLEGROUNDS\/comments\/71gzpi\/greatly_improve_fps_new_method\/","WindyCityBull"],["It didn’t really change anything for me, oh well, it was a good idea.","UltraMadBoomer"],["bullying content found, text deleted!","CrimsonCoast"],["Dunno if op was the actual op but this does work.","Kiregnik"],["The box for \"Override high DPI scaling behavior\" should already be checked by default.","ashberic"],["No FPS improvement for me, but I'm playing on an high DPI screen already. 1440p. ","Laraset"]],"NumberOfComment":6,"Upvote_Count":10,"CreatedAt":1506186816000},"85kxgi":{"subreddit":"PUBG","Author":"Wafflestarship","Title":"Level 3 backpack found at Best Buy!","Content":"","url":"https:\/\/i.imgur.com\/QU8iXPf.jpg","Comments":[["do u even molle?","worldmusicfan"],["69...nice","QuistInTheVille"],["http:\/\/tankwarroom.com\/article\/1240\/where-to-buy-your-own-pubg-level-3-backpack","None"],["bullying content found, text deleted!","darth_maul--"],["Not even.","Lemonade_Girl"],["Wrong.. This is it.. Its a 5.11 72 Rush bag. \n\nhttps:\/\/tacticalgear.com\/511-rush-72-backpack-tac-od?hp=y&gclid=Cj0KCQjwv73VBRCdARIsAOnG8u0BKGr7ogRb6rtSBmZG5Y1f-FUOo-okaUlKGzCVKnLXxAMElC7vrswaAslREALw_wcB#\/16539\/8554\/1&dl=b","None"]],"NumberOfComment":6,"Upvote_Count":1,"CreatedAt":1521477961000},"94zu1h":{"subreddit":"PUBG","Author":"twi57ed","Title":"Yup.","Content":"","url":"https:\/\/i.redd.it\/gm5jfrxzyfe11.jpg","Comments":[["bullying content found, text deleted!","Humb3l"],["As much as I didn't really want to comment in what has become a toxic space, I'd still like to throw my two cents in. \n\n1. I don't want the ping system. I feel like proper, effective team communication is a big part of the game. A part of the game that can separate the \"good\" teams from the \"not as good\" teams. \n\n2. I can see why it would be great. It can help with language and communication barriers. It'll also help with the \"he's over there\" callouts. \n\n3. It'll change strategies of many players. If the tree you're behind is pinged, you're in trouble if you're gonna stay there for a length of time. \n\n4. Someone pings a tree\/rock\/window\/hill, etc, that you're at. That whole team may very well focus on just that point, so if you move\/flank\/shift, etc, you have the one up on them. \n\n(Not to mention the extra distracting crap on the screen for people who don't clear pings. *cough cough* Remove your damn map markers! Lol)\n\nSo, as much as I don't personally want it in the game, it's going to be, and I'm going to use the hell out of it. Just like the plane path showing (I also wish they didn't add), it's a feature available for every player, and it's your choice to use it or not. And to use it well or not. \n\nHappy chicken dinners! ","AvaSkye"],["So what I’ve learned today is that there are good ol’ average players who enjoy a good time and a good game and enjoying said good game.\n\nAnd then there’s this guy.\n\nIt’s ok to not like something, it’s ok to have an opinion. Carrying on with yourself the way you are is what’s digging your hole even deeper. Love or hate the system, it’s no reason to hate the players. Shitpost the game, not the player base. That shows extreme immaturity and lack of comprehension on the subject you’re speaking about.\n\nRip in peps","Dead-Zone-Echo"],["bullying content found, text deleted!","ironlabel1"],["[deleted]","None"],["bullying content found, text deleted!","rngskrtskrt"],["I'm actually excited for this, and if you're afraid people will have ESP like shit going on bc their teammate spotted you maybe you shouldn't sit behind the same tree or rock while in a fight and find angles where only one of your opponents can see you? Lol.. If you're good at communicating and have callouts for everything hey good for you, I have those for specific hotdrop places I go too like milly but it's an overal very welcome addition to me ","efterblivenrov"],["Take my money.","Ceb1x"],["This ping system is gonna be horrible and it’s gonna give the better players a bigger advantage over the average players- I don’t think it will last honestly- once everyone realizes why they get melted instantly and everyone will be crying “I get melted instantly every time I stick my head up” and soon after this thread will be filled with everyone screaming- GET RID OF IT- you all think it sounds like a great idea now,in theory- but just wait till it’s actually in game- it’s gonna hurt way more ppl than it’s gonna help!!","MyDArKPsNGr"],["bet you changed the text on my meme","lol-u-gay"],["The interesting thing is that I have more karma points since the upload and I received tons of hate and downvotes.  \nThis means, that there is a lot of players who agree with this and they aren't getting involved in the comments-circus.  \nGood enough for me.  \nJust try to remember this post, because after a month, the same people who are welcoming the change,  \nwill be crying to be removed.","twi57ed"],["bullying content found, text deleted!","c0nkah"],["bullying content found, text deleted!","hoobickler"]],"NumberOfComment":13,"Upvote_Count":40,"CreatedAt":1533551264000},"6ri2n6":{"subreddit":"PUBG","Author":"None","Title":"Disappointed in PUBG today","Content":"They put micro transactions and money before making an actually functional game. The lag makes the game nearly unplayable, the FPP mode is riddled with issues, it's awful. \n\nThe only thing that works is the transactions. Shame man. Shame.","url":"https:\/\/www.reddit.com\/r\/PUBG\/comments\/6ri2n6\/disappointed_in_pubg_today\/","Comments":[["I am gonna get downvoted to shit for this, but I dont see what the big problem is with these micro-transactions. Sure, the game is not out yet, but you also don't have to buy them and don't really matter all that much. Not to mention the fact that the game has no source of revenue besides what they make from sales. They need some other kind of revenue, so why not harmless clothing items? Sounds fine to me. Don't have to pay more if you don't want to and can still get the same cosmetic shit. Sounds fine to me.","squirrelchips"],["If you don't like microtransactions, don't buy them. They provide NO advantage. They're purely cosmetic. What is the big deal? Also, you have to be fucking joking me. They added SO MUCH in this update and you're complaining about irrelevant microtransactions and lag that they have acknowledged and are working on right now?","theglowcloudred"],["The additions of micro transactions didn't cause this and it'll get hotfixed, it was a pretty big patch after all.","Tobax"],["I can't believe how many people are crying about the lag. Yeah, it sucks... but this is an EARLY ACCESS GAME! This type of stuff is part of what you signed up for unfortunately.   ","drnick5"],["bullying content found, text deleted!","Wantsomepeniscake"],["I don't think it is shameful really. I agree with you that putting in micro transactions at all when they had promised not to is pretty shady and dumb, but like what was already said, the game is still in development. Not to mention that this is one of the only early access games that at least I have ever seen that actually give a shit about what the majority of players want and work tirelessly on the game to prepare it for launch. That out of any early access game is commendable. I just think this patch was rushed when it didn't need to be. It had only been on the test servers for a little while. I have missed being able to play the game today, but i'm hopeful that the lag will be fixed very soon.","RayyonTheCrayyon"],["But... mini skirt...","HingleMcCringle_"],["To be honest its not a bad move, I had never heard of the game before it popped up on steam. Thought it looked pretty meh had been done before etc etc, but reviews were great so figured i would give it a spin and i loved it. You don't need to spend money if you don't want to, but this will help keep the game alive in the long run, hopefully.\nAnd yes the bugs right now are a pain in the ass being unable to get my homicidal tendencies on, but that is what we signed up for as beta testers for early access, hopefully its resolved in a timely manner and we can get back to killing soon. \nThe thing i really hope is that this community doesn't go the way of rust and turn into a bunch of entitled asshats, who expect their every whim be catered for. ","Barb0b0t"],["complaining about the lag is understandable. but i don't get why you goobers keep making a big deal about cosmetic microtransactions, they literally don't affect the gameplay whatsoever.","Spasticated"],["why the FUCK does everyone complain about limited time cosmetic micro transactions? \n\ndon't like em, don't buy em. You'll probably be better off, the clothes are flashy as fuck in those crates and make you easier to spot. Hell, you can buy the crates w your BP and sell them for like $3\n\nEDIT: Also it's an early access game and it had a buggy patch. that's not shocking. like at all. tons of triple A games have buggy patches like this that are fixed within a day and we don't get all these pretentious people claiming how disappointing it is.","TheAeroWalrus"],["bullying content found, text deleted!","Tod_Gottes"],["That's what you get with a one day test server. And then when there are lag issues in the test realm, fuck it, release the patch anyway and then leave some shit comment about how we need to be patient. Maybe they should've been patient releasing the patch. ","AmazingKreiderman"],["What the fuck is wrong with microtransactions? Its not a pay2win system, its your choice to buy crates or not. But the important thing is, devs get steady cash flow to work on the game. I see no problem with that. \n\nAlso, with all the great stuff and quick responses with updates, i find it wrong for everyone to bash them now. They didn't expect the lag problems (i assume there were none on test servers) and the started working on it right away. Please people, give them a chance. This is not EA.","nepheelim"],["I really just don't get whiney posts like this and other posts calling out Playerunknown. The guy is making a tournament with prizes and getting the community to pay for it, by choice and not forcing them. While being completely transparent. They listen to feedback and they fix things. Posts like this, are the ones that turn the dev\/community relationship sour. This isn't a many opinion, it is a few.","shalesey"],["It's in development, bro...","dommu"],["Hey all you dudes hating on micro transactions. Don't bother watching the gamescom tournament we are helping fund. I know you'll be there anyways though.","vulkv2"],["Yeah I'm not too pleased with the rollout of this patch. Honestly, they should roll it back to the previous revision until the server lag issue is fixed. As it is right now, I don't plan on playing until it's fixed because the lag is straight unbearable currently.","NiTeMaYoR"],["bullying content found, text deleted!","Skubbags"],["I can't believe they would do such a thing, like I understand they need money fair enough but come on at least have the game working properly before you add stuff like this\nSame thing that paladins dude hence why I can't play that game anymore ","thedevilssauce"],["[deleted]","None"],["[deleted]","None"],["Shh","sentientspud1"],["Amazing that the beta gamemode has issues. Lag is annoying of course, but it probably means the servers will get better. key purchases are working really well because they are probably entirely through steam. The money made from these keys might even help upgrade the servers.","Lovurr"],["I think the number of returning players for FPP is contributing to the lag and things more than the patch. As a long-time amateur game developer, I can't see how the changes they've made would lead to so much more lag. It's probably because so many people came back to try FPP (which I think is great btw).","mghoffmann"],["bullying content found, text deleted!","TheMightyFijian"],["bullying content found, text deleted!","auronvi"],["Thanks to the fans of r\/pubg for making my honest criticisms of a game we all love feel welcome here. \/s","None"],["The second any game puts micro-transactions, everyone claims the game is bad. FPP is not awful, its actually pretty god damn dope. The lag isnt that much of an issue although it could use some work but it definitely dosent make the game unplayable. ","None"],["bullying content found, text deleted!","guccivintage"],["I'm really pissed off about this. They sold so many copies. Made over a $100 mil in sales. And people still say \"oh well, it's just Early Access\". It's not. It has been what.. 3 months since it sold 4 mil copies? That's enough time for them to get their shit together and start closing gaps to a full lunch. Not adding new greedy features that are aiming directly for your wallet again. \nThis is the equivalent of a kickstarter campaign getting funded and then instead of starting work on shipping you the full product, they start working on stuff to add to the product that will cost extra money. Yes, it's cosmetic. but it's insulting to any one of us who paid $30 for a broken game out of faith that it'll become less broken.\n\nPlus, everyone gave crap to EA when they lunched Battlefield 1 with paid DLCs. But that game constantly adds new weapon skins for free in loot crates that you purchase with in game currency. And the DLCs that you do pay for, actually ADD real content. Stuff that are worthwhile to pay for. \nAnd not to mention how their game was released immediately without bugs and runs smooth as fuck. That should be the standard to hold PUBG to. Not some indie made at home game.   ","AxlLight"],["Go to \/r\/pubattlegrounds for this sort of thing. Join the cacophony of people there. I came to this sub because it's not like that here.","None"],["I sold all of my crates today and didn't do too badly.. so while you may hate them, they have made it so I recouped my initial investment in the game.","psychocabbage"],["To clear things up you have to remember that's it's diffrent teams. Some work on bugs. Other work on new guns. Some work with the community and some work with skins","maxpax02"],["bullying content found, text deleted!","PessimisticSnake"],["OFF","PessimisticSnake"],["I agree micro transaction before game is actually out is kinda like announcing a season pass when game is not even out. It shouldn't happen.. but that's how it is now.\n\n\nOn a side note... games in Canada are 80$ for AAA. Now that CA$ is slowly catching up on US$.. are the games going to be a little cheaper? It used to be 60$, then raised to 70$ and one year later 80$. I've been told that the quick last steep in price was due to CA$ been weaker. But now.\n\n","Plisken999"],["Agree. They already made hundreds of millions and now implement micro transaction crates? Fucking ridicilous.\nWill only try it again once they implement 1st person only servers","ghuldorgrey"],["I knew it was just an h1z1 reskin. ","kuwimonster"],["Ya it is pretty sad, and there are a bunch of fan boys on reddit making excuses for them too luls.  This disaster needs rolled back to previous patch . . .","sah_24"]],"NumberOfComment":39,"Upvote_Count":68,"CreatedAt":1501823259000},"89d377":{"subreddit":"PUBG","Author":"PhilQuantumBullet","Title":"WHERE is the jungle in the new map? Is this what PUBG player call jungle??","Content":"","url":"https:\/\/i.redd.it\/02ng3uphqop01.png","Comments":[["the buildings arent even finished yet chill out. ","Jibberish92"],["bullying content found, text deleted!","DeadlyPants02"],["It's a alpha version, just wait till it's finished. No point to complain already?!","Okkulti_SW"],["Yeah, I would love very dense map. you might even use a pan if your are silent enough.","Meerkateagle"],["Dude from the looks of your graphics settings, if there was a jungle your pc probably couldn’t handle it... ","None"],["Honestly I agree with this. I want a dense jungle, not five trees 10 meters apart from each other. It allows for varying gameplay.","Go_fyourself"],["I figured it would be sparse.  Jungle foliage is much harder on a PC than deserts.","Odoul"],["It’s really as dense as it should be, there’s a ton of cover relative to the existing maps, but not so much that you’re tripping over people.","DeliciousNoodle"],["Honestly I feel the same way having played the Arma 3 Tanoa map.\n\nHowever this is an alpha version of the (new pubg) map on which the main design intention is to have faster rounds with more constant player engagements. Meaning everyone gets to see more people, more often and have more interactions than on the larger maps.\n\nI thoroughly enjoyed Tanoa and hope they can add more without straining the low graphics users even more (we all know pubg doesnt run too well).","HenryyyyyyyyJenkins"],["Older and rather bad engine manages to give player this http:\/\/i.imgur.com\/zZNtwJ8.jpg and even Mods http:\/\/www.armaholic.com\/datas\/users\/jungle2_4.jpg","PhilQuantumBullet"]],"NumberOfComment":10,"Upvote_Count":0,"CreatedAt":1522761269000},"868541":{"subreddit":"PUBG","Author":"NaterBud21","Title":"bullying content found, text deleted!","Content":"bullying content found, text deleted!","url":"https:\/\/www.reddit.com\/r\/PUBG\/comments\/868541\/devs_fix_your_fucking_servers_please\/","Comments":[["> PC players, we will be running a 3 hour server maintenance period on our live servers to implement additional changes to our backend systems.\n> \n> The maintenance will start Mar 21 7PM PDT \/ Mar 22 3AM CET \/ Mar 22 11AM KST. Thank you for your understanding.","tpoint47"],["Go to the community hub on steam","Hotskys"],["This happens when they do updates. Patience is key. ","Hotskys"],["You didn't get thw memo? The fix was to launch and host the cell phone clients.","kjcurtis"],["bullying content found, text deleted!","darth_maul--"],["bullying content found, text deleted!","peacekeeper76"]],"NumberOfComment":6,"Upvote_Count":0,"CreatedAt":1521685310000}}